Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0256gpm036.h
extern volatile __AD1CON1bits_t AD1CON1bits __asm__ ("AD1CON1") __attribute__((section("sfrs"), address(0xBF802260)));
extern volatile uint32_t        AD1CON1CLR __attribute__((section("sfrs"),address(0xBF802264)));
extern volatile uint32_t        AD1CON1SET __attribute__((section("sfrs"),address(0xBF802268)));
extern volatile uint32_t        AD1CON1INV __attribute__((section("sfrs"),address(0xBF80226C)));
#define AD1CON2 AD1CON2
extern volatile uint32_t   AD1CON2 __attribute__((section("sfrs"), address(0xBF802270)));
typedef struct {
  uint32_t :1;
  uint32_t BUFM:1;
  uint32_t SMPI:5;
  uint32_t BUFS:1;
  uint32_t :2;
  uint32_t CSCNA:1;
  uint32_t BUFREGEN:1;
  uint32_t OFFCAL:1;
  uint32_t VCFG:3;
} __AD1CON2bits_t;
extern volatile __AD1CON2bits_t AD1CON2bits __asm__ ("AD1CON2") __attribute__((section("sfrs"), address(0xBF802270)));
extern volatile uint32_t        AD1CON2CLR __attribute__((section("sfrs"),address(0xBF802274)));
extern volatile uint32_t        AD1CON2SET __attribute__((section("sfrs"),address(0xBF802278)));
extern volatile uint32_t        AD1CON2INV __attribute__((section("sfrs"),address(0xBF80227C)));
#define AD1CON3 AD1CON3
extern volatile uint32_t   AD1CON3 __attribute__((section("sfrs"), address(0xBF802280)));
typedef struct {
  uint32_t ADCS:8;
  uint32_t SAMC:5;
  uint32_t :1;
  uint32_t EXTSAM:1;
  uint32_t ADRC:1;
} __AD1CON3bits_t;
extern volatile __AD1CON3bits_t AD1CON3bits __asm__ ("AD1CON3") __attribute__((section("sfrs"), address(0xBF802280)));
extern volatile uint32_t        AD1CON3CLR __attribute__((section("sfrs"),address(0xBF802284)));
extern volatile uint32_t        AD1CON3SET __attribute__((section("sfrs"),address(0xBF802288)));
extern volatile uint32_t        AD1CON3INV __attribute__((section("sfrs"),address(0xBF80228C)));
#define AD1CHS AD1CHS
extern volatile uint32_t   AD1CHS __attribute__((section("sfrs"), address(0xBF802290)));
typedef struct {
  uint32_t CH0SA:5;
  uint32_t CH0NA:3;
} __AD1CHSbits_t;
extern volatile __AD1CHSbits_t AD1CHSbits __asm__ ("AD1CHS") __attribute__((section("sfrs"), address(0xBF802290)));
extern volatile uint32_t        AD1CHSCLR __attribute__((section("sfrs"),address(0xBF802294)));
extern volatile uint32_t        AD1CHSSET __attribute__((section("sfrs"),address(0xBF802298)));
extern volatile uint32_t        AD1CHSINV __attribute__((section("sfrs"),address(0xBF80229C)));
#define AD1CSS AD1CSS
extern volatile uint32_t   AD1CSS __attribute__((section("sfrs"), address(0xBF8022A0)));
typedef struct {
  uint32_t CSS0:1;
  uint32_t CSS1:1;
  uint32_t CSS2:1;
  uint32_t CSS3:1;
  uint32_t CSS4:1;
  uint32_t CSS5:1;
  uint32_t CSS6:1;
  uint32_t CSS7:1;
  uint32_t CSS8:1;
  uint32_t CSS9:1;
  uint32_t CSS10:1;
  uint32_t CSS11:1;
  uint32_t CSS12:1;
  uint32_t CSS13:1;
  uint32_t CSS14:1;
  uint32_t CSS15:1;
  uint32_t CSS16:1;
  uint32_t CSS17:1;
  uint32_t CSS18:1;
  uint32_t CSS19:1;
  uint32_t CSS20:1;
  uint32_t CSS21:1;
  uint32_t CSS22:1;
  uint32_t CSS23:1;
  uint32_t CSS24:1;
  uint32_t CSS25:1;
  uint32_t CSS26:1;
  uint32_t CSS27:1;
  uint32_t CSS28:1;
  uint32_t CSS29:1;
  uint32_t CSS30:1;
  uint32_t CSS31:1;
} __AD1CSSbits_t;
extern volatile __AD1CSSbits_t AD1CSSbits __asm__ ("AD1CSS") __attribute__((section("sfrs"), address(0xBF8022A0)));
extern volatile uint32_t        AD1CSSCLR __attribute__((section("sfrs"),address(0xBF8022A4)));
extern volatile uint32_t        AD1CSSSET __attribute__((section("sfrs"),address(0xBF8022A8)));
extern volatile uint32_t        AD1CSSINV __attribute__((section("sfrs"),address(0xBF8022AC)));
#define AD1CON5 AD1CON5
extern volatile uint32_t   AD1CON5 __attribute__((section("sfrs"), address(0xBF8022C0)));
typedef struct {
  uint32_t CM:2;
  uint32_t WM:2;
  uint32_t :4;
  uint32_t ASINT:2;
  uint32_t :2;
  uint32_t BGREQ:1;
  uint32_t :1;
  uint32_t LPEN:1;
  uint32_t ASEN:1;
} __AD1CON5bits_t;
extern volatile __AD1CON5bits_t AD1CON5bits __asm__ ("AD1CON5") __attribute__((section("sfrs"), address(0xBF8022C0)));
extern volatile uint32_t        AD1CON5CLR __attribute__((section("sfrs"),address(0xBF8022C4)));
extern volatile uint32_t        AD1CON5SET __attribute__((section("sfrs"),address(0xBF8022C8)));
extern volatile uint32_t        AD1CON5INV __attribute__((section("sfrs"),address(0xBF8022CC)));
#define AD1CHIT AD1CHIT
extern volatile uint32_t   AD1CHIT __attribute__((section("sfrs"), address(0xBF8022D0)));
typedef struct {
  uint32_t CHH0:1;
  uint32_t CHH1:1;
  uint32_t CHH2:1;
  uint32_t CHH3:1;
  uint32_t CHH4:1;
  uint32_t CHH5:1;
  uint32_t CHH6:1;
  uint32_t CHH7:1;
  uint32_t CHH8:1;
  uint32_t CHH9:1;
  uint32_t CHH10:1;
  uint32_t CHH11:1;
  uint32_t CHH12:1;
  uint32_t CHH13:1;
  uint32_t CHH14:1;
  uint32_t CHH15:1;
  uint32_t CHH16:1;
  uint32_t CHH17:1;
  uint32_t CHH18:1;
  uint32_t CHH19:1;
} __AD1CHITbits_t;
extern volatile __AD1CHITbits_t AD1CHITbits __asm__ ("AD1CHIT") __attribute__((section("sfrs"), address(0xBF8022D0)));
extern volatile uint32_t        AD1CHITCLR __attribute__((section("sfrs"),address(0xBF8022D4)));
extern volatile uint32_t        AD1CHITSET __attribute__((section("sfrs"),address(0xBF8022D8)));
extern volatile uint32_t        AD1CHITINV __attribute__((section("sfrs"),address(0xBF8022DC)));
#define CMSTAT CMSTAT
extern volatile uint32_t   CMSTAT __attribute__((section("sfrs"), address(0xBF802300)));
typedef struct {
  uint32_t C1OUT:1;
  uint32_t C2OUT:1;
  uint32_t C3OUT:1;
  uint32_t :5;
  uint32_t CVREFSEL:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :2;
  uint32_t C1EVT:1;
  uint32_t C2EVT:1;
  uint32_t C3EVT:1;
} __CMSTATbits_t;
extern volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs"), address(0xBF802300)));
extern volatile uint32_t        CMSTATCLR __attribute__((section("sfrs"),address(0xBF802304)));
extern volatile uint32_t        CMSTATSET __attribute__((section("sfrs"),address(0xBF802308)));
extern volatile uint32_t        CMSTATINV __attribute__((section("sfrs"),address(0xBF80230C)));
#define CM1CON CM1CON
extern volatile uint32_t   CM1CON __attribute__((section("sfrs"), address(0xBF802310)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :3;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
} __CM1CONbits_t;
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs"), address(0xBF802310)));
extern volatile uint32_t        CM1CONCLR __attribute__((section("sfrs"),address(0xBF802314)));
extern volatile uint32_t        CM1CONSET __attribute__((section("sfrs"),address(0xBF802318)));
extern volatile uint32_t        CM1CONINV __attribute__((section("sfrs"),address(0xBF80231C)));
#define CM2CON CM2CON
extern volatile uint32_t   CM2CON __attribute__((section("sfrs"), address(0xBF802330)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :3;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs"), address(0xBF802330)));
extern volatile uint32_t        CM2CONCLR __attribute__((section("sfrs"),address(0xBF802334)));
extern volatile uint32_t        CM2CONSET __attribute__((section("sfrs"),address(0xBF802338)));
extern volatile uint32_t        CM2CONINV __attribute__((section("sfrs"),address(0xBF80233C)));
#define CM3CON CM3CON
extern volatile uint32_t   CM3CON __attribute__((section("sfrs"), address(0xBF802350)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :3;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
} __CM3CONbits_t;
extern volatile __CM3CONbits_t CM3CONbits __asm__ ("CM3CON") __attribute__((section("sfrs"), address(0xBF802350)));
extern volatile uint32_t        CM3CONCLR __attribute__((section("sfrs"),address(0xBF802354)));
extern volatile uint32_t        CM3CONSET __attribute__((section("sfrs"),address(0xBF802358)));
extern volatile uint32_t        CM3CONINV __attribute__((section("sfrs"),address(0xBF80235C)));
#define DAC1CON DAC1CON
extern volatile uint32_t   DAC1CON __attribute__((section("sfrs"), address(0xBF802380)));
typedef struct {
  uint32_t REFSEL:2;
  uint32_t :6;
  uint32_t DACOE:1;
  uint32_t :6;
  uint32_t ON:1;
  uint32_t DACDAT:16;
} __DAC1CONbits_t;
extern volatile __DAC1CONbits_t DAC1CONbits __asm__ ("DAC1CON") __attribute__((section("sfrs"), address(0xBF802380)));
extern volatile uint32_t        DAC1CONCLR __attribute__((section("sfrs"),address(0xBF802384)));
extern volatile uint32_t        DAC1CONSET __attribute__((section("sfrs"),address(0xBF802388)));
extern volatile uint32_t        DAC1CONINV __attribute__((section("sfrs"),address(0xBF80238C)));
#define CLC1CON CLC1CON
extern volatile uint32_t   CLC1CON __attribute__((section("sfrs"), address(0xBF802480)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC1CONbits_t;
