Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0256gpm036.h
extern volatile __CLC4CONbits_t CLC4CONbits __asm__ ("CLC4CON") __attribute__((section("sfrs"), address(0xBF802600)));
extern volatile uint32_t        CLC4CONCLR __attribute__((section("sfrs"),address(0xBF802604)));
extern volatile uint32_t        CLC4CONSET __attribute__((section("sfrs"),address(0xBF802608)));
extern volatile uint32_t        CLC4CONINV __attribute__((section("sfrs"),address(0xBF80260C)));
#define CLC4SEL CLC4SEL
extern volatile uint32_t   CLC4SEL __attribute__((section("sfrs"), address(0xBF802610)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC4SELbits_t;
extern volatile __CLC4SELbits_t CLC4SELbits __asm__ ("CLC4SEL") __attribute__((section("sfrs"), address(0xBF802610)));
extern volatile uint32_t        CLC4SELCLR __attribute__((section("sfrs"),address(0xBF802614)));
extern volatile uint32_t        CLC4SELSET __attribute__((section("sfrs"),address(0xBF802618)));
extern volatile uint32_t        CLC4SELINV __attribute__((section("sfrs"),address(0xBF80261C)));
#define CLC4GLS CLC4GLS
extern volatile uint32_t   CLC4GLS __attribute__((section("sfrs"), address(0xBF802620)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC4GLSbits_t;
extern volatile __CLC4GLSbits_t CLC4GLSbits __asm__ ("CLC4GLS") __attribute__((section("sfrs"), address(0xBF802620)));
extern volatile uint32_t        CLC4GLSCLR __attribute__((section("sfrs"),address(0xBF802624)));
extern volatile uint32_t        CLC4GLSSET __attribute__((section("sfrs"),address(0xBF802628)));
extern volatile uint32_t        CLC4GLSINV __attribute__((section("sfrs"),address(0xBF80262C)));
#define OSCCON OSCCON
extern volatile uint32_t   OSCCON __attribute__((section("sfrs"), address(0xBF802680)));
typedef struct {
  uint32_t OSWEN:1;
  uint32_t SOSCEN:1;
  uint32_t :1;
  uint32_t CF:1;
  uint32_t SLPEN:1;
  uint32_t :2;
  uint32_t CLKLOCK:1;
  uint32_t NOSC:3;
  uint32_t :1;
  uint32_t COSC:3;
  uint32_t :6;
  uint32_t SLP2SPD:1;
  uint32_t :1;
  uint32_t DRMEN:1;
  uint32_t FRCDIV:3;
} __OSCCONbits_t;
extern volatile __OSCCONbits_t OSCCONbits __asm__ ("OSCCON") __attribute__((section("sfrs"), address(0xBF802680)));
extern volatile uint32_t        OSCCONCLR __attribute__((section("sfrs"),address(0xBF802684)));
extern volatile uint32_t        OSCCONSET __attribute__((section("sfrs"),address(0xBF802688)));
extern volatile uint32_t        OSCCONINV __attribute__((section("sfrs"),address(0xBF80268C)));
#define SPLLCON SPLLCON
extern volatile uint32_t   SPLLCON __attribute__((section("sfrs"), address(0xBF8026A0)));
typedef struct {
  uint32_t :7;
  uint32_t PLLICLK:1;
  uint32_t :8;
  uint32_t PLLMULT:7;
  uint32_t :1;
  uint32_t PLLODIV:3;
} __SPLLCONbits_t;
extern volatile __SPLLCONbits_t SPLLCONbits __asm__ ("SPLLCON") __attribute__((section("sfrs"), address(0xBF8026A0)));
extern volatile uint32_t        SPLLCONCLR __attribute__((section("sfrs"),address(0xBF8026A4)));
extern volatile uint32_t        SPLLCONSET __attribute__((section("sfrs"),address(0xBF8026A8)));
extern volatile uint32_t        SPLLCONINV __attribute__((section("sfrs"),address(0xBF8026AC)));
#define RCON RCON
extern volatile uint32_t   RCON __attribute__((section("sfrs"), address(0xBF8026E0)));
typedef struct {
  uint32_t POR:1;
  uint32_t BOR:1;
  uint32_t IDLE:1;
  uint32_t SLEEP:1;
  uint32_t WDTO:1;
  uint32_t :1;
  uint32_t SWR:1;
  uint32_t EXTR:1;
  uint32_t :1;
  uint32_t CMR:1;
  uint32_t :16;
  uint32_t BCFGFAIL:1;
  uint32_t BCFGERR:1;
  uint32_t :2;
  uint32_t PORCORE:1;
  uint32_t PORIO:1;
} __RCONbits_t;
extern volatile __RCONbits_t RCONbits __asm__ ("RCON") __attribute__((section("sfrs"), address(0xBF8026E0)));
extern volatile uint32_t        RCONCLR __attribute__((section("sfrs"),address(0xBF8026E4)));
extern volatile uint32_t        RCONSET __attribute__((section("sfrs"),address(0xBF8026E8)));
extern volatile uint32_t        RCONINV __attribute__((section("sfrs"),address(0xBF8026EC)));
#define RSWRST RSWRST
extern volatile uint32_t   RSWRST __attribute__((section("sfrs"), address(0xBF8026F0)));
typedef struct {
  uint32_t SWRST:1;
} __RSWRSTbits_t;
extern volatile __RSWRSTbits_t RSWRSTbits __asm__ ("RSWRST") __attribute__((section("sfrs"), address(0xBF8026F0)));
extern volatile uint32_t        RSWRSTCLR __attribute__((section("sfrs"),address(0xBF8026F4)));
extern volatile uint32_t        RSWRSTSET __attribute__((section("sfrs"),address(0xBF8026F8)));
extern volatile uint32_t        RSWRSTINV __attribute__((section("sfrs"),address(0xBF8026FC)));
#define RNMICON RNMICON
extern volatile uint32_t   RNMICON __attribute__((section("sfrs"), address(0xBF802700)));
typedef union {
  struct {
    uint32_t NMICNT:16;
    uint32_t WDTS:1;
    uint32_t CF:1;
    uint32_t LVD:1;
    uint32_t GNMI:1;
    uint32_t :3;
    uint32_t SWNMI:1;
    uint32_t WDTO:1;
  };
  struct {
    uint32_t :24;
    uint32_t WDTR:1;
  };
} __RNMICONbits_t;
extern volatile __RNMICONbits_t RNMICONbits __asm__ ("RNMICON") __attribute__((section("sfrs"), address(0xBF802700)));
extern volatile uint32_t        RNMICONCLR __attribute__((section("sfrs"),address(0xBF802704)));
extern volatile uint32_t        RNMICONSET __attribute__((section("sfrs"),address(0xBF802708)));
extern volatile uint32_t        RNMICONINV __attribute__((section("sfrs"),address(0xBF80270C)));
#define PWRCON PWRCON
extern volatile uint32_t   PWRCON __attribute__((section("sfrs"), address(0xBF802710)));
typedef struct {
  uint32_t VREGS:1;
  uint32_t RETEN:1;
  uint32_t SBOREN:1;
} __PWRCONbits_t;
extern volatile __PWRCONbits_t PWRCONbits __asm__ ("PWRCON") __attribute__((section("sfrs"), address(0xBF802710)));
extern volatile uint32_t        PWRCONCLR __attribute__((section("sfrs"),address(0xBF802714)));
extern volatile uint32_t        PWRCONSET __attribute__((section("sfrs"),address(0xBF802718)));
extern volatile uint32_t        PWRCONINV __attribute__((section("sfrs"),address(0xBF80271C)));
#define REFO1CON REFO1CON
extern volatile uint32_t   REFO1CON __attribute__((section("sfrs"), address(0xBF802720)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO1CONbits_t;
