Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0256gpm036.h
extern volatile __NVMDATA0bits_t NVMDATA0bits __asm__ ("NVMDATA0") __attribute__((section("sfrs"), address(0xBF802960)));
extern volatile uint32_t        NVMDATA0CLR __attribute__((section("sfrs"),address(0xBF802964)));
extern volatile uint32_t        NVMDATA0SET __attribute__((section("sfrs"),address(0xBF802968)));
extern volatile uint32_t        NVMDATA0INV __attribute__((section("sfrs"),address(0xBF80296C)));
#define NVMDATA1 NVMDATA1
extern volatile uint32_t   NVMDATA1 __attribute__((section("sfrs"), address(0xBF802970)));
typedef struct {
  uint32_t NVMDATA1:32;
} __NVMDATA1bits_t;
extern volatile __NVMDATA1bits_t NVMDATA1bits __asm__ ("NVMDATA1") __attribute__((section("sfrs"), address(0xBF802970)));
extern volatile uint32_t        NVMDATA1CLR __attribute__((section("sfrs"),address(0xBF802974)));
extern volatile uint32_t        NVMDATA1SET __attribute__((section("sfrs"),address(0xBF802978)));
extern volatile uint32_t        NVMDATA1INV __attribute__((section("sfrs"),address(0xBF80297C)));
#define NVMSRCADDR NVMSRCADDR
extern volatile uint32_t   NVMSRCADDR __attribute__((section("sfrs"), address(0xBF802980)));
typedef struct {
  uint32_t NVMSRCADDR:32;
} __NVMSRCADDRbits_t;
extern volatile __NVMSRCADDRbits_t NVMSRCADDRbits __asm__ ("NVMSRCADDR") __attribute__((section("sfrs"), address(0xBF802980)));
extern volatile uint32_t        NVMSRCADDRCLR __attribute__((section("sfrs"),address(0xBF802984)));
extern volatile uint32_t        NVMSRCADDRSET __attribute__((section("sfrs"),address(0xBF802988)));
extern volatile uint32_t        NVMSRCADDRINV __attribute__((section("sfrs"),address(0xBF80298C)));
#define NVMPWP NVMPWP
extern volatile uint32_t   NVMPWP __attribute__((section("sfrs"), address(0xBF802990)));
typedef struct {
  uint32_t PWP:24;
  uint32_t :7;
  uint32_t PWPULOCK:1;
} __NVMPWPbits_t;
extern volatile __NVMPWPbits_t NVMPWPbits __asm__ ("NVMPWP") __attribute__((section("sfrs"), address(0xBF802990)));
extern volatile uint32_t        NVMPWPCLR __attribute__((section("sfrs"),address(0xBF802994)));
extern volatile uint32_t        NVMPWPSET __attribute__((section("sfrs"),address(0xBF802998)));
extern volatile uint32_t        NVMPWPINV __attribute__((section("sfrs"),address(0xBF80299C)));
#define NVMBWP NVMBWP
extern volatile uint32_t   NVMBWP __attribute__((section("sfrs"), address(0xBF8029A0)));
typedef struct {
  uint32_t :8;
  uint32_t BWP0:1;
  uint32_t BWP1:1;
  uint32_t BWP2:1;
  uint32_t :4;
  uint32_t BWPULOCK:1;
} __NVMBWPbits_t;
extern volatile __NVMBWPbits_t NVMBWPbits __asm__ ("NVMBWP") __attribute__((section("sfrs"), address(0xBF8029A0)));
extern volatile uint32_t        NVMBWPCLR __attribute__((section("sfrs"),address(0xBF8029A4)));
extern volatile uint32_t        NVMBWPSET __attribute__((section("sfrs"),address(0xBF8029A8)));
extern volatile uint32_t        NVMBWPINV __attribute__((section("sfrs"),address(0xBF8029AC)));
#define RPCON RPCON
extern volatile uint32_t   RPCON __attribute__((section("sfrs"), address(0xBF802A00)));
typedef struct {
  uint32_t :11;
  uint32_t IOLOCK:1;
} __RPCONbits_t;
extern volatile __RPCONbits_t RPCONbits __asm__ ("RPCON") __attribute__((section("sfrs"), address(0xBF802A00)));
extern volatile uint32_t        RPCONCLR __attribute__((section("sfrs"),address(0xBF802A04)));
extern volatile uint32_t        RPCONSET __attribute__((section("sfrs"),address(0xBF802A08)));
extern volatile uint32_t        RPCONINV __attribute__((section("sfrs"),address(0xBF802A0C)));
#define RPINR1 RPINR1
extern volatile uint32_t   RPINR1 __attribute__((section("sfrs"), address(0xBF802A20)));
typedef struct {
  uint32_t INT4R:5;
} __RPINR1bits_t;
extern volatile __RPINR1bits_t RPINR1bits __asm__ ("RPINR1") __attribute__((section("sfrs"), address(0xBF802A20)));
extern volatile uint32_t        RPINR1CLR __attribute__((section("sfrs"),address(0xBF802A24)));
extern volatile uint32_t        RPINR1SET __attribute__((section("sfrs"),address(0xBF802A28)));
extern volatile uint32_t        RPINR1INV __attribute__((section("sfrs"),address(0xBF802A2C)));
#define RPINR2 RPINR2
extern volatile uint32_t   RPINR2 __attribute__((section("sfrs"), address(0xBF802A30)));
typedef struct {
  uint32_t :16;
  uint32_t ICM1R:5;
  uint32_t :3;
  uint32_t ICM2R:5;
} __RPINR2bits_t;
extern volatile __RPINR2bits_t RPINR2bits __asm__ ("RPINR2") __attribute__((section("sfrs"), address(0xBF802A30)));
extern volatile uint32_t        RPINR2CLR __attribute__((section("sfrs"),address(0xBF802A34)));
extern volatile uint32_t        RPINR2SET __attribute__((section("sfrs"),address(0xBF802A38)));
extern volatile uint32_t        RPINR2INV __attribute__((section("sfrs"),address(0xBF802A3C)));
#define RPINR3 RPINR3
extern volatile uint32_t   RPINR3 __attribute__((section("sfrs"), address(0xBF802A40)));
typedef struct {
  uint32_t ICM3R:5;
  uint32_t :3;
  uint32_t ICM4R:5;
} __RPINR3bits_t;
extern volatile __RPINR3bits_t RPINR3bits __asm__ ("RPINR3") __attribute__((section("sfrs"), address(0xBF802A40)));
extern volatile uint32_t        RPINR3CLR __attribute__((section("sfrs"),address(0xBF802A44)));
extern volatile uint32_t        RPINR3SET __attribute__((section("sfrs"),address(0xBF802A48)));
extern volatile uint32_t        RPINR3INV __attribute__((section("sfrs"),address(0xBF802A4C)));
#define RPINR5 RPINR5
extern volatile uint32_t   RPINR5 __attribute__((section("sfrs"), address(0xBF802A60)));
typedef struct {
  uint32_t :16;
  uint32_t OCFAR:5;
  uint32_t :3;
  uint32_t OCFBR:5;
} __RPINR5bits_t;
extern volatile __RPINR5bits_t RPINR5bits __asm__ ("RPINR5") __attribute__((section("sfrs"), address(0xBF802A60)));
extern volatile uint32_t        RPINR5CLR __attribute__((section("sfrs"),address(0xBF802A64)));
extern volatile uint32_t        RPINR5SET __attribute__((section("sfrs"),address(0xBF802A68)));
extern volatile uint32_t        RPINR5INV __attribute__((section("sfrs"),address(0xBF802A6C)));
#define RPINR6 RPINR6
extern volatile uint32_t   RPINR6 __attribute__((section("sfrs"), address(0xBF802A70)));
typedef struct {
  uint32_t TCKIAR:5;
  uint32_t :3;
  uint32_t TCKIBR:5;
} __RPINR6bits_t;
extern volatile __RPINR6bits_t RPINR6bits __asm__ ("RPINR6") __attribute__((section("sfrs"), address(0xBF802A70)));
extern volatile uint32_t        RPINR6CLR __attribute__((section("sfrs"),address(0xBF802A74)));
extern volatile uint32_t        RPINR6SET __attribute__((section("sfrs"),address(0xBF802A78)));
extern volatile uint32_t        RPINR6INV __attribute__((section("sfrs"),address(0xBF802A7C)));
#define RPINR7 RPINR7
extern volatile uint32_t   RPINR7 __attribute__((section("sfrs"), address(0xBF802A80)));
typedef struct {
  uint32_t ICM5R:5;
  uint32_t :3;
  uint32_t ICM6R:5;
  uint32_t :3;
  uint32_t ICM7R:5;
  uint32_t :3;
  uint32_t ICM8R:5;
} __RPINR7bits_t;
