Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0256gpm036.h
extern volatile __Bbits_t Bbits __asm__ ("B") __attribute__((section("sfrs"), address(0xBF802CB0)));
extern volatile uint32_t        ANSELBCLR __attribute__((section("sfrs"),address(0xBF802CB4)));
extern volatile uint32_t        BCLR __attribute__((section("sfrs"),address(0xBF802CB4)));
extern volatile uint32_t        ANSELBSET __attribute__((section("sfrs"),address(0xBF802CB8)));
extern volatile uint32_t        BSET __attribute__((section("sfrs"),address(0xBF802CB8)));
extern volatile uint32_t        ANSELBINV __attribute__((section("sfrs"),address(0xBF802CBC)));
extern volatile uint32_t        BINV __attribute__((section("sfrs"),address(0xBF802CBC)));
#define TRISB TRISB
extern volatile uint32_t   TRISB __attribute__((section("sfrs"), address(0xBF802CC0)));
typedef union {
  struct {
    uint32_t TRISB0:1;
    uint32_t TRISB1:1;
    uint32_t TRISB2:1;
    uint32_t TRISB3:1;
    uint32_t TRISB4:1;
    uint32_t TRISB5:1;
    uint32_t TRISB6:1;
    uint32_t TRISB7:1;
    uint32_t TRISB8:1;
    uint32_t TRISB9:1;
    uint32_t TRISB10:1;
    uint32_t TRISB11:1;
    uint32_t :1;
    uint32_t TRISB13:1;
    uint32_t TRISB14:1;
    uint32_t TRISB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISBbits_t;
extern volatile __TRISBbits_t TRISBbits __asm__ ("TRISB") __attribute__((section("sfrs"), address(0xBF802CC0)));
extern volatile uint32_t        TRISBCLR __attribute__((section("sfrs"),address(0xBF802CC4)));
extern volatile uint32_t        TRISBSET __attribute__((section("sfrs"),address(0xBF802CC8)));
extern volatile uint32_t        TRISBINV __attribute__((section("sfrs"),address(0xBF802CCC)));
#define PORTB PORTB
extern volatile uint32_t   PORTB __attribute__((section("sfrs"), address(0xBF802CD0)));
typedef union {
  struct {
    uint32_t RB0:1;
    uint32_t RB1:1;
    uint32_t RB2:1;
    uint32_t RB3:1;
    uint32_t RB4:1;
    uint32_t RB5:1;
    uint32_t RB6:1;
    uint32_t RB7:1;
    uint32_t RB8:1;
    uint32_t RB9:1;
    uint32_t RB10:1;
    uint32_t RB11:1;
    uint32_t :1;
    uint32_t RB13:1;
    uint32_t RB14:1;
    uint32_t RB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTBbits_t;
extern volatile __PORTBbits_t PORTBbits __asm__ ("PORTB") __attribute__((section("sfrs"), address(0xBF802CD0)));
extern volatile uint32_t        PORTBCLR __attribute__((section("sfrs"),address(0xBF802CD4)));
extern volatile uint32_t        PORTBSET __attribute__((section("sfrs"),address(0xBF802CD8)));
extern volatile uint32_t        PORTBINV __attribute__((section("sfrs"),address(0xBF802CDC)));
#define LATB LATB
extern volatile uint32_t   LATB __attribute__((section("sfrs"), address(0xBF802CE0)));
typedef union {
  struct {
    uint32_t LATB0:1;
    uint32_t LATB1:1;
    uint32_t LATB2:1;
    uint32_t LATB3:1;
    uint32_t LATB4:1;
    uint32_t LATB5:1;
    uint32_t LATB6:1;
    uint32_t LATB7:1;
    uint32_t LATB8:1;
    uint32_t LATB9:1;
    uint32_t LATB10:1;
    uint32_t LATB11:1;
    uint32_t :1;
    uint32_t LATB13:1;
    uint32_t LATB14:1;
    uint32_t LATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATBbits_t;
extern volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs"), address(0xBF802CE0)));
extern volatile uint32_t        LATBCLR __attribute__((section("sfrs"),address(0xBF802CE4)));
extern volatile uint32_t        LATBSET __attribute__((section("sfrs"),address(0xBF802CE8)));
extern volatile uint32_t        LATBINV __attribute__((section("sfrs"),address(0xBF802CEC)));
#define ODCB ODCB
extern volatile uint32_t   ODCB __attribute__((section("sfrs"), address(0xBF802CF0)));
typedef union {
  struct {
    uint32_t ODCB0:1;
    uint32_t ODCB1:1;
    uint32_t ODCB2:1;
    uint32_t ODCB3:1;
    uint32_t ODCB4:1;
    uint32_t ODCB5:1;
    uint32_t ODCB6:1;
    uint32_t ODCB7:1;
    uint32_t ODCB8:1;
    uint32_t ODCB9:1;
    uint32_t ODCB10:1;
    uint32_t ODCB11:1;
    uint32_t :1;
    uint32_t ODCB13:1;
    uint32_t ODCB14:1;
    uint32_t ODCB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCBbits_t;
extern volatile __ODCBbits_t ODCBbits __asm__ ("ODCB") __attribute__((section("sfrs"), address(0xBF802CF0)));
extern volatile uint32_t        ODCBCLR __attribute__((section("sfrs"),address(0xBF802CF4)));
extern volatile uint32_t        ODCBSET __attribute__((section("sfrs"),address(0xBF802CF8)));
extern volatile uint32_t        ODCBINV __attribute__((section("sfrs"),address(0xBF802CFC)));
#define CNPUB CNPUB
extern volatile uint32_t   CNPUB __attribute__((section("sfrs"), address(0xBF802D00)));
typedef union {
  struct {
    uint32_t CNPUB0:1;
    uint32_t CNPUB1:1;
    uint32_t CNPUB2:1;
    uint32_t CNPUB3:1;
    uint32_t CNPUB4:1;
    uint32_t CNPUB5:1;
    uint32_t CNPUB6:1;
    uint32_t CNPUB7:1;
    uint32_t CNPUB8:1;
    uint32_t CNPUB9:1;
    uint32_t CNPUB10:1;
    uint32_t CNPUB11:1;
    uint32_t :1;
    uint32_t CNPUB13:1;
    uint32_t CNPUB14:1;
    uint32_t CNPUB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUBbits_t;
extern volatile __CNPUBbits_t CNPUBbits __asm__ ("CNPUB") __attribute__((section("sfrs"), address(0xBF802D00)));
extern volatile uint32_t        CNPUBCLR __attribute__((section("sfrs"),address(0xBF802D04)));
extern volatile uint32_t        CNPUBSET __attribute__((section("sfrs"),address(0xBF802D08)));
extern volatile uint32_t        CNPUBINV __attribute__((section("sfrs"),address(0xBF802D0C)));
#define CNPDB CNPDB
extern volatile uint32_t   CNPDB __attribute__((section("sfrs"), address(0xBF802D10)));
typedef union {
  struct {
    uint32_t CNPDB0:1;
    uint32_t CNPDB1:1;
    uint32_t CNPDB2:1;
    uint32_t CNPDB3:1;
    uint32_t CNPDB4:1;
    uint32_t CNPDB5:1;
    uint32_t CNPDB6:1;
    uint32_t CNPDB7:1;
    uint32_t CNPDB8:1;
    uint32_t CNPDB9:1;
    uint32_t CNPDB10:1;
    uint32_t CNPDB11:1;
    uint32_t :1;
    uint32_t CNPDB13:1;
    uint32_t CNPDB14:1;
    uint32_t CNPDB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDBbits_t;
extern volatile __CNPDBbits_t CNPDBbits __asm__ ("CNPDB") __attribute__((section("sfrs"), address(0xBF802D10)));
extern volatile uint32_t        CNPDBCLR __attribute__((section("sfrs"),address(0xBF802D14)));
extern volatile uint32_t        CNPDBSET __attribute__((section("sfrs"),address(0xBF802D18)));
extern volatile uint32_t        CNPDBINV __attribute__((section("sfrs"),address(0xBF802D1C)));
#define CNCONB CNCONB
extern volatile uint32_t   CNCONB __attribute__((section("sfrs"), address(0xBF802D20)));
typedef union {
  struct {
    uint32_t :10;
    uint32_t PORT32:1;
    uint32_t CNSTYLE:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONBbits_t;
extern volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB") __attribute__((section("sfrs"), address(0xBF802D20)));
extern volatile uint32_t        CNCONBCLR __attribute__((section("sfrs"),address(0xBF802D24)));
extern volatile uint32_t        CNCONBSET __attribute__((section("sfrs"),address(0xBF802D28)));
extern volatile uint32_t        CNCONBINV __attribute__((section("sfrs"),address(0xBF802D2C)));
#define CNEN0B CNEN0B
extern volatile uint32_t   CNEN0B __attribute__((section("sfrs"), address(0xBF802D30)));
typedef union {
  struct {
    uint32_t CNIE0B0:1;
    uint32_t CNIE0B1:1;
    uint32_t CNIE0B2:1;
    uint32_t CNIE0B3:1;
    uint32_t CNIE0B4:1;
    uint32_t CNIE0B5:1;
    uint32_t CNIE0B6:1;
    uint32_t CNIE0B7:1;
    uint32_t CNIE0B8:1;
    uint32_t CNIE0B9:1;
    uint32_t CNIE0B10:1;
    uint32_t CNIE0B11:1;
    uint32_t :1;
    uint32_t CNIE0B13:1;
    uint32_t CNIE0B14:1;
    uint32_t CNIE0B15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN0Bbits_t;
