Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0256gpm036.h
extern volatile __DCH2SSAbits_t DCH2SSAbits __asm__ ("DCH2SSA") __attribute__((section("sfrs"), address(0xBF808B10)));
extern volatile uint32_t        DCH2SSACLR __attribute__((section("sfrs"),address(0xBF808B14)));
extern volatile uint32_t        DCH2SSASET __attribute__((section("sfrs"),address(0xBF808B18)));
extern volatile uint32_t        DCH2SSAINV __attribute__((section("sfrs"),address(0xBF808B1C)));
#define DCH2DSA DCH2DSA
extern volatile uint32_t   DCH2DSA __attribute__((section("sfrs"), address(0xBF808B20)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH2DSAbits_t;
extern volatile __DCH2DSAbits_t DCH2DSAbits __asm__ ("DCH2DSA") __attribute__((section("sfrs"), address(0xBF808B20)));
extern volatile uint32_t        DCH2DSACLR __attribute__((section("sfrs"),address(0xBF808B24)));
extern volatile uint32_t        DCH2DSASET __attribute__((section("sfrs"),address(0xBF808B28)));
extern volatile uint32_t        DCH2DSAINV __attribute__((section("sfrs"),address(0xBF808B2C)));
#define DCH2SSIZ DCH2SSIZ
extern volatile uint32_t   DCH2SSIZ __attribute__((section("sfrs"), address(0xBF808B30)));
extern volatile uint32_t        DCH2SSIZCLR __attribute__((section("sfrs"),address(0xBF808B34)));
extern volatile uint32_t        DCH2SSIZSET __attribute__((section("sfrs"),address(0xBF808B38)));
extern volatile uint32_t        DCH2SSIZINV __attribute__((section("sfrs"),address(0xBF808B3C)));
#define DCH2DSIZ DCH2DSIZ
extern volatile uint32_t   DCH2DSIZ __attribute__((section("sfrs"), address(0xBF808B40)));
extern volatile uint32_t        DCH2DSIZCLR __attribute__((section("sfrs"),address(0xBF808B44)));
extern volatile uint32_t        DCH2DSIZSET __attribute__((section("sfrs"),address(0xBF808B48)));
extern volatile uint32_t        DCH2DSIZINV __attribute__((section("sfrs"),address(0xBF808B4C)));
#define DCH2SPTR DCH2SPTR
extern volatile uint32_t   DCH2SPTR __attribute__((section("sfrs"), address(0xBF808B50)));
extern volatile uint32_t        DCH2SPTRCLR __attribute__((section("sfrs"),address(0xBF808B54)));
extern volatile uint32_t        DCH2SPTRSET __attribute__((section("sfrs"),address(0xBF808B58)));
extern volatile uint32_t        DCH2SPTRINV __attribute__((section("sfrs"),address(0xBF808B5C)));
#define DCH2DPTR DCH2DPTR
extern volatile uint32_t   DCH2DPTR __attribute__((section("sfrs"), address(0xBF808B60)));
extern volatile uint32_t        DCH2DPTRCLR __attribute__((section("sfrs"),address(0xBF808B64)));
extern volatile uint32_t        DCH2DPTRSET __attribute__((section("sfrs"),address(0xBF808B68)));
extern volatile uint32_t        DCH2DPTRINV __attribute__((section("sfrs"),address(0xBF808B6C)));
#define DCH2CSIZ DCH2CSIZ
extern volatile uint32_t   DCH2CSIZ __attribute__((section("sfrs"), address(0xBF808B70)));
extern volatile uint32_t        DCH2CSIZCLR __attribute__((section("sfrs"),address(0xBF808B74)));
extern volatile uint32_t        DCH2CSIZSET __attribute__((section("sfrs"),address(0xBF808B78)));
extern volatile uint32_t        DCH2CSIZINV __attribute__((section("sfrs"),address(0xBF808B7C)));
#define DCH2CPTR DCH2CPTR
extern volatile uint32_t   DCH2CPTR __attribute__((section("sfrs"), address(0xBF808B80)));
extern volatile uint32_t        DCH2CPTRCLR __attribute__((section("sfrs"),address(0xBF808B84)));
extern volatile uint32_t        DCH2CPTRSET __attribute__((section("sfrs"),address(0xBF808B88)));
extern volatile uint32_t        DCH2CPTRINV __attribute__((section("sfrs"),address(0xBF808B8C)));
#define DCH2DAT DCH2DAT
extern volatile uint32_t   DCH2DAT __attribute__((section("sfrs"), address(0xBF808B90)));
extern volatile uint32_t        DCH2DATCLR __attribute__((section("sfrs"),address(0xBF808B94)));
extern volatile uint32_t        DCH2DATSET __attribute__((section("sfrs"),address(0xBF808B98)));
extern volatile uint32_t        DCH2DATINV __attribute__((section("sfrs"),address(0xBF808B9C)));
#define DCH3CON DCH3CON
extern volatile uint32_t   DCH3CON __attribute__((section("sfrs"), address(0xBF808BA0)));
typedef union {
  struct {
    uint32_t CHPRI:2;
    uint32_t CHEDET:1;
    uint32_t :1;
    uint32_t CHAEN:1;
    uint32_t CHCHN:1;
    uint32_t CHAED:1;
    uint32_t CHEN:1;
    uint32_t CHCHNS:1;
    uint32_t :6;
    uint32_t CHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH3CONbits_t;
extern volatile __DCH3CONbits_t DCH3CONbits __asm__ ("DCH3CON") __attribute__((section("sfrs"), address(0xBF808BA0)));
extern volatile uint32_t        DCH3CONCLR __attribute__((section("sfrs"),address(0xBF808BA4)));
extern volatile uint32_t        DCH3CONSET __attribute__((section("sfrs"),address(0xBF808BA8)));
extern volatile uint32_t        DCH3CONINV __attribute__((section("sfrs"),address(0xBF808BAC)));
#define DCH3ECON DCH3ECON
extern volatile uint32_t   DCH3ECON __attribute__((section("sfrs"), address(0xBF808BB0)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t AIRQEN:1;
    uint32_t SIRQEN:1;
    uint32_t PATEN:1;
    uint32_t CABORT:1;
    uint32_t CFORCE:1;
    uint32_t CHSIRQ:8;
    uint32_t CHAIRQ:8;
  };
  struct {
    uint32_t w:32;
  };
} __DCH3ECONbits_t;
extern volatile __DCH3ECONbits_t DCH3ECONbits __asm__ ("DCH3ECON") __attribute__((section("sfrs"), address(0xBF808BB0)));
extern volatile uint32_t        DCH3ECONCLR __attribute__((section("sfrs"),address(0xBF808BB4)));
extern volatile uint32_t        DCH3ECONSET __attribute__((section("sfrs"),address(0xBF808BB8)));
extern volatile uint32_t        DCH3ECONINV __attribute__((section("sfrs"),address(0xBF808BBC)));
#define DCH3INT DCH3INT
extern volatile uint32_t   DCH3INT __attribute__((section("sfrs"), address(0xBF808BC0)));
typedef union {
  struct {
    uint32_t CHERIF:1;
    uint32_t CHTAIF:1;
    uint32_t CHCCIF:1;
    uint32_t CHBCIF:1;
    uint32_t CHDHIF:1;
    uint32_t CHDDIF:1;
    uint32_t CHSHIF:1;
    uint32_t CHSDIF:1;
    uint32_t :8;
    uint32_t CHERIE:1;
    uint32_t CHTAIE:1;
    uint32_t CHCCIE:1;
    uint32_t CHBCIE:1;
    uint32_t CHDHIE:1;
    uint32_t CHDDIE:1;
    uint32_t CHSHIE:1;
    uint32_t CHSDIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH3INTbits_t;
extern volatile __DCH3INTbits_t DCH3INTbits __asm__ ("DCH3INT") __attribute__((section("sfrs"), address(0xBF808BC0)));
extern volatile uint32_t        DCH3INTCLR __attribute__((section("sfrs"),address(0xBF808BC4)));
extern volatile uint32_t        DCH3INTSET __attribute__((section("sfrs"),address(0xBF808BC8)));
extern volatile uint32_t        DCH3INTINV __attribute__((section("sfrs"),address(0xBF808BCC)));
#define DCH3SSA DCH3SSA
extern volatile uint32_t   DCH3SSA __attribute__((section("sfrs"), address(0xBF808BD0)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH3SSAbits_t;
extern volatile __DCH3SSAbits_t DCH3SSAbits __asm__ ("DCH3SSA") __attribute__((section("sfrs"), address(0xBF808BD0)));
extern volatile uint32_t        DCH3SSACLR __attribute__((section("sfrs"),address(0xBF808BD4)));
extern volatile uint32_t        DCH3SSASET __attribute__((section("sfrs"),address(0xBF808BD8)));
extern volatile uint32_t        DCH3SSAINV __attribute__((section("sfrs"),address(0xBF808BDC)));
#define DCH3DSA DCH3DSA
extern volatile uint32_t   DCH3DSA __attribute__((section("sfrs"), address(0xBF808BE0)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH3DSAbits_t;
extern volatile __DCH3DSAbits_t DCH3DSAbits __asm__ ("DCH3DSA") __attribute__((section("sfrs"), address(0xBF808BE0)));
extern volatile uint32_t        DCH3DSACLR __attribute__((section("sfrs"),address(0xBF808BE4)));
extern volatile uint32_t        DCH3DSASET __attribute__((section("sfrs"),address(0xBF808BE8)));
extern volatile uint32_t        DCH3DSAINV __attribute__((section("sfrs"),address(0xBF808BEC)));
#define DCH3SSIZ DCH3SSIZ
extern volatile uint32_t   DCH3SSIZ __attribute__((section("sfrs"), address(0xBF808BF0)));
extern volatile uint32_t        DCH3SSIZCLR __attribute__((section("sfrs"),address(0xBF808BF4)));
extern volatile uint32_t        DCH3SSIZSET __attribute__((section("sfrs"),address(0xBF808BF8)));
extern volatile uint32_t        DCH3SSIZINV __attribute__((section("sfrs"),address(0xBF808BFC)));
#define DCH3DSIZ DCH3DSIZ
extern volatile uint32_t   DCH3DSIZ __attribute__((section("sfrs"), address(0xBF808C00)));
extern volatile uint32_t        DCH3DSIZCLR __attribute__((section("sfrs"),address(0xBF808C04)));
extern volatile uint32_t        DCH3DSIZSET __attribute__((section("sfrs"),address(0xBF808C08)));
extern volatile uint32_t        DCH3DSIZINV __attribute__((section("sfrs"),address(0xBF808C0C)));
#define DCH3SPTR DCH3SPTR
extern volatile uint32_t   DCH3SPTR __attribute__((section("sfrs"), address(0xBF808C10)));
extern volatile uint32_t        DCH3SPTRCLR __attribute__((section("sfrs"),address(0xBF808C14)));
extern volatile uint32_t        DCH3SPTRSET __attribute__((section("sfrs"),address(0xBF808C18)));
extern volatile uint32_t        DCH3SPTRINV __attribute__((section("sfrs"),address(0xBF808C1C)));
#define DCH3DPTR DCH3DPTR
extern volatile uint32_t   DCH3DPTR __attribute__((section("sfrs"), address(0xBF808C20)));
extern volatile uint32_t        DCH3DPTRCLR __attribute__((section("sfrs"),address(0xBF808C24)));
extern volatile uint32_t        DCH3DPTRSET __attribute__((section("sfrs"),address(0xBF808C28)));
extern volatile uint32_t        DCH3DPTRINV __attribute__((section("sfrs"),address(0xBF808C2C)));
#define DCH3CSIZ DCH3CSIZ
extern volatile uint32_t   DCH3CSIZ __attribute__((section("sfrs"), address(0xBF808C30)));
extern volatile uint32_t        DCH3CSIZCLR __attribute__((section("sfrs"),address(0xBF808C34)));
extern volatile uint32_t        DCH3CSIZSET __attribute__((section("sfrs"),address(0xBF808C38)));
extern volatile uint32_t        DCH3CSIZINV __attribute__((section("sfrs"),address(0xBF808C3C)));
#define DCH3CPTR DCH3CPTR
extern volatile uint32_t   DCH3CPTR __attribute__((section("sfrs"), address(0xBF808C40)));
extern volatile uint32_t        DCH3CPTRCLR __attribute__((section("sfrs"),address(0xBF808C44)));
extern volatile uint32_t        DCH3CPTRSET __attribute__((section("sfrs"),address(0xBF808C48)));
extern volatile uint32_t        DCH3CPTRINV __attribute__((section("sfrs"),address(0xBF808C4C)));
#define DCH3DAT DCH3DAT
extern volatile uint32_t   DCH3DAT __attribute__((section("sfrs"), address(0xBF808C50)));
extern volatile uint32_t        DCH3DATCLR __attribute__((section("sfrs"),address(0xBF808C54)));
extern volatile uint32_t        DCH3DATSET __attribute__((section("sfrs"),address(0xBF808C58)));
extern volatile uint32_t        DCH3DATINV __attribute__((section("sfrs"),address(0xBF808C5C)));
#define INTCON INTCON
extern volatile uint32_t   INTCON __attribute__((section("sfrs"), address(0xBF80F000)));
typedef struct {
  uint32_t INT0EP:1;
  uint32_t INT1EP:1;
  uint32_t INT2EP:1;
  uint32_t INT3EP:1;
  uint32_t INT4EP:1;
  uint32_t :3;
  uint32_t TPC:3;
  uint32_t :1;
  uint32_t MVEC:1;
  uint32_t :3;
  uint32_t VS:7;
} __INTCONbits_t;
