Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0256gpm036.h
#define _IPC16_I2C1SIS_POSITION                  0x00000008
#define _IPC16_I2C1SIS_MASK                      0x00000300
#define _IPC16_I2C1SIS_LENGTH                    0x00000002

#define _IPC16_I2C1SIP_POSITION                  0x0000000A
#define _IPC16_I2C1SIP_MASK                      0x00001C00
#define _IPC16_I2C1SIP_LENGTH                    0x00000003

#define _IPC16_I2C1MIS_POSITION                  0x00000010
#define _IPC16_I2C1MIS_MASK                      0x00030000
#define _IPC16_I2C1MIS_LENGTH                    0x00000002

#define _IPC16_I2C1MIP_POSITION                  0x00000012
#define _IPC16_I2C1MIP_MASK                      0x001C0000
#define _IPC16_I2C1MIP_LENGTH                    0x00000003

#define _IPC16_I2C1BCIS_POSITION                 0x00000018
#define _IPC16_I2C1BCIS_MASK                     0x03000000
#define _IPC16_I2C1BCIS_LENGTH                   0x00000002

#define _IPC16_I2C1BCIP_POSITION                 0x0000001A
#define _IPC16_I2C1BCIP_MASK                     0x1C000000
#define _IPC16_I2C1BCIP_LENGTH                   0x00000003

#define _IPC17_I2C2SIS_POSITION                  0x00000000
#define _IPC17_I2C2SIS_MASK                      0x00000003
#define _IPC17_I2C2SIS_LENGTH                    0x00000002

#define _IPC17_I2C2SIP_POSITION                  0x00000002
#define _IPC17_I2C2SIP_MASK                      0x0000001C
#define _IPC17_I2C2SIP_LENGTH                    0x00000003

#define _IPC17_I2C2MIS_POSITION                  0x00000008
#define _IPC17_I2C2MIS_MASK                      0x00000300
#define _IPC17_I2C2MIS_LENGTH                    0x00000002

#define _IPC17_I2C2MIP_POSITION                  0x0000000A
#define _IPC17_I2C2MIP_MASK                      0x00001C00
#define _IPC17_I2C2MIP_LENGTH                    0x00000003

#define _IPC17_I2C2BCIS_POSITION                 0x00000010
#define _IPC17_I2C2BCIS_MASK                     0x00030000
#define _IPC17_I2C2BCIS_LENGTH                   0x00000002

#define _IPC17_I2C2BCIP_POSITION                 0x00000012
#define _IPC17_I2C2BCIP_MASK                     0x001C0000
#define _IPC17_I2C2BCIP_LENGTH                   0x00000003

#define _IPC17_I2C3SIS_POSITION                  0x00000018
#define _IPC17_I2C3SIS_MASK                      0x03000000
#define _IPC17_I2C3SIS_LENGTH                    0x00000002

#define _IPC17_I2C3SIP_POSITION                  0x0000001A
#define _IPC17_I2C3SIP_MASK                      0x1C000000
#define _IPC17_I2C3SIP_LENGTH                    0x00000003

#define _IPC18_I2C3MIS_POSITION                  0x00000000
#define _IPC18_I2C3MIS_MASK                      0x00000003
#define _IPC18_I2C3MIS_LENGTH                    0x00000002

#define _IPC18_I2C3MIP_POSITION                  0x00000002
#define _IPC18_I2C3MIP_MASK                      0x0000001C
#define _IPC18_I2C3MIP_LENGTH                    0x00000003

#define _IPC18_I2C3BCIS_POSITION                 0x00000008
#define _IPC18_I2C3BCIS_MASK                     0x00000300
#define _IPC18_I2C3BCIS_LENGTH                   0x00000002

#define _IPC18_I2C3BCIP_POSITION                 0x0000000A
#define _IPC18_I2C3BCIP_MASK                     0x00001C00
#define _IPC18_I2C3BCIP_LENGTH                   0x00000003

#define _IPC18_CCP1IS_POSITION                   0x00000010
#define _IPC18_CCP1IS_MASK                       0x00030000
#define _IPC18_CCP1IS_LENGTH                     0x00000002

#define _IPC18_CCP1IP_POSITION                   0x00000012
#define _IPC18_CCP1IP_MASK                       0x001C0000
#define _IPC18_CCP1IP_LENGTH                     0x00000003

#define _IPC18_CCT1IS_POSITION                   0x00000018
#define _IPC18_CCT1IS_MASK                       0x03000000
#define _IPC18_CCT1IS_LENGTH                     0x00000002

#define _IPC18_CCT1IP_POSITION                   0x0000001A
#define _IPC18_CCT1IP_MASK                       0x1C000000
#define _IPC18_CCT1IP_LENGTH                     0x00000003

#define _IPC19_CCP2IS_POSITION                   0x00000000
#define _IPC19_CCP2IS_MASK                       0x00000003
#define _IPC19_CCP2IS_LENGTH                     0x00000002

#define _IPC19_CCP2IP_POSITION                   0x00000002
#define _IPC19_CCP2IP_MASK                       0x0000001C
#define _IPC19_CCP2IP_LENGTH                     0x00000003

#define _IPC19_CCT2IS_POSITION                   0x00000008
#define _IPC19_CCT2IS_MASK                       0x00000300
#define _IPC19_CCT2IS_LENGTH                     0x00000002

#define _IPC19_CCT2IP_POSITION                   0x0000000A
#define _IPC19_CCT2IP_MASK                       0x00001C00
#define _IPC19_CCT2IP_LENGTH                     0x00000003

#define _IPC19_CCP3IS_POSITION                   0x00000010
#define _IPC19_CCP3IS_MASK                       0x00030000
#define _IPC19_CCP3IS_LENGTH                     0x00000002

#define _IPC19_CCP3IP_POSITION                   0x00000012
#define _IPC19_CCP3IP_MASK                       0x001C0000
#define _IPC19_CCP3IP_LENGTH                     0x00000003

#define _IPC19_CCT3IS_POSITION                   0x00000018
#define _IPC19_CCT3IS_MASK                       0x03000000
#define _IPC19_CCT3IS_LENGTH                     0x00000002

#define _IPC19_CCT3IP_POSITION                   0x0000001A
#define _IPC19_CCT3IP_MASK                       0x1C000000
#define _IPC19_CCT3IP_LENGTH                     0x00000003

#define _IPC20_CCP4IS_POSITION                   0x00000000
#define _IPC20_CCP4IS_MASK                       0x00000003
#define _IPC20_CCP4IS_LENGTH                     0x00000002

#define _IPC20_CCP4IP_POSITION                   0x00000002
#define _IPC20_CCP4IP_MASK                       0x0000001C
#define _IPC20_CCP4IP_LENGTH                     0x00000003

#define _IPC20_CCT4IS_POSITION                   0x00000008
#define _IPC20_CCT4IS_MASK                       0x00000300
#define _IPC20_CCT4IS_LENGTH                     0x00000002

#define _IPC20_CCT4IP_POSITION                   0x0000000A
#define _IPC20_CCT4IP_MASK                       0x00001C00
#define _IPC20_CCT4IP_LENGTH                     0x00000003

#define _IPC20_CCP5IS_POSITION                   0x00000010
#define _IPC20_CCP5IS_MASK                       0x00030000
#define _IPC20_CCP5IS_LENGTH                     0x00000002

#define _IPC20_CCP5IP_POSITION                   0x00000012
#define _IPC20_CCP5IP_MASK                       0x001C0000
#define _IPC20_CCP5IP_LENGTH                     0x00000003

#define _IPC20_CCT5IS_POSITION                   0x00000018
#define _IPC20_CCT5IS_MASK                       0x03000000
#define _IPC20_CCT5IS_LENGTH                     0x00000002

